read_verilog  fadder.sv
compile
report_timing
report_area

Invoke the synthesis tool: design_vision-xg -f syn_script
