read_sverilog ./rtl_src/alu.sv
compile
check_design
report_timing
report_area
report_hierarchy
write -format verilog -hierarchy -output rtl_src/alu.gate.v
