read_verilog fadder.sv
read_verilog adder8.sv
read_verilog alu.sv
compile
report_timing
report_area
write -format verilog -hierarchy -output alu.gate.v
quit!
