read_verilog alu.sv
compile
report_timing
report_area
write -format verilog -hierarchy -output alu.gate.v
quit!
