read_verilog fadder.sv
compile
report_timing
report_area
